{
  "id": "co-parenting-with-bipolar-partner",
  "title": "Co-Parenting With Bipolar Partner",
  "version": "0.9.3-polished",
  "acts": [
    {
      "id": "act-1",
      "title": "The Morning Spiral",
      "steps": [
        {
          "id": "a1s1",
          "text": "It’s early morning. Your phone buzzes with a long message from your ex-partner.\n\nOnly the first line shows on the lock screen:\n“ I can’t do this anymore. Everything is too much…”\n\nYou already know how a single line like that can set the emotional weather for the whole day — before anyone has even finished breakfast."
        },
        {
          "id": "a1s2",
          "text": "When you read the full message, it's the familiar blend: desperation, blame, sudden ideas.\n\nYour ex jumps between wanting more contact, then less, then none. Hints of suicidal thinking mix with flashes of anger: “You never understood what it's like in my head.”\n\nYou've seen this pattern before — a storm front made of big feelings, fast plans, and the fear that everything might change overnight."
        },
        {
          "id": "a1s3",
          "text": "“I'm tired of being treated like I'm unstable,” your ex writes.\n\nA few messages later:\n“Maybe you should just take full custody. I'm obviously the problem.”\n\nThe swing from anger to surrender is sharp enough to make you pause."
        },
        {
          "id": "a1s4",
          "text": "You glance at the clock. In less than an hour your child will wake up, and both of you will have to navigate today's handover.\n\nThis isn't just about texts — it's about the kind of morning your child walks into. With bipolar disorder in the mix, mornings aren’t only routines; they shape how safe the day feels."
        },
        {
          "id": "a1s5",
          "text": "Your child's footsteps pad down the hallway.\n“Is mom/dad coming today?”\n\nTheir question isn't just about plans — it's about safety. Your answer sets the tone for the whole morning."
        },
        {
          "id": "a1end",
          "endOfAct": true,
          "text": "Act 1 closes on a simple scene: a child waiting by the door, and two adults trying — in very different ways — to manage a storm.\n\nUp next is Act 2, where you prepare your response."
        }
      ]
    },

    {
      "id": "act-2",
      "title": "Composing the Response",
      "steps": [
        {
          "id": "a2s1",
          "text": "Before you reply, you take a moment to breathe.\nYou've learned that with bipolar disorder, timing matters just as much as wording.\n\nA fast reaction can inflame things.\nA calm, grounded one can stabilize the whole day — especially for your child."
        },
        {
          "id": "a2s2",
          "text": "You remind yourself of one important truth: your ex isn't choosing these emotional swings.\n\nMania and depression change pace, intensity, and logic.\nThis morning's messages came from pain, not strategy."
        },
        {
          "id": "a2s3",
          "text": "None of this excuses hurtful words — but it helps explain why conversations shift so quickly.\n\nA calm message from you can slow the spiral.\nA sharp one can accelerate it."
        },
        {
          "id": "a2s4",
          "text": "You watch your child getting ready.\nTheir morning, their energy, their sense of stability — it all depends on how the next hour unfolds.\n\nYou decide to reply with intention, not reaction."
        },
        {
          "id": "a2s5",
          "choices": [
            {
              "id": "a2cA",
              "text": "“Hey… I hear you. I know mornings can be overwhelming. Let’s slow down and take this one step at a time.”",
              "goto": "a2s6A",
              "effects": { "trust": 1, "tension": -1 }
            },
            {
              "id": "a2cB",
              "text": "“I want to talk, but I need the conversation to stay calm. Can you tell me what you're feeling right now?”",
              "goto": "a2s6B",
              "effects": { "trust": 0, "tension": -1 }
            },
            {
              "id": "a2cC",
              "text": "“I see your message. Before anything else — are we still on for the handover today?”",
              "goto": "a2s6C",
              "effects": { "childStress": -1 }
            },
            {
              "id": "a2cD",
              "text": "“I'll write when I can focus properly. Give me a moment.”",
              "goto": "a2s6D",
              "effects": {}
            }
          ]
        },
        {
          "id": "a2s6A",
          "text": "Your message seems to land softly.\n\n“I… I don’t know. I'm just tired,” they reply.\n\nThe tone is still shaky, but lower, quieter — a small sign of stabilization."
        },
        {
          "id": "a2s6B",
          "text": "“I *am* calm,” they snap — then immediately add: “Sorry. I didn't mean it like that.”\n\nThere's volatility, but also a crack in the tension."
        },
        {
          "id": "a2s6C",
          "text": "“Yes. I'm coming. I just… needed to say something.”\n\nThe conversation shifts, even if the emotions still swirl underneath."
        },
        {
          "id": "a2s6D",
          "text": "A few minutes pass.\n\nThen: “Okay. Take your time.”\n\nSpace often helps — especially before a handover."
        },
        {
          "id": "a2end",
          "endOfAct": true,
          "text": "Act 2 closes with your chosen tone — steady, intentional, and aware.\n\nNext comes Act 3, where you prepare for the handover."
        }
      ]
    },

    {
      "id": "act-3",
      "title": "Preparing for the Handover",
      "steps": [
        {
          "id": "a3s1",
          "text": "You start getting ready for the handover.\nShoes by the door. Backpack checked. Snack box packed.\n\nYour child watches you closely — not the routine, but the mood.\nKids feel tension before anyone says a word."
        },
        {
          "id": "a3s2",
          "text": "“Is everything okay today?” your child asks.\n\nYou smile gently. “Yes. We're doing our best today.”\n\nIt's not about pretending everything is perfect — it's about giving them enough calm to feel safe."
        },
        {
          "id": "a3s3",
          "text": "As you zip the backpack, you remind yourself:\nYour child doesn’t need the details.\n\nThey need predictability.\nA handover that feels normal, even when the adults are still finding their footing."
        },
        {
          "id": "a3s4",
          "text": "You check your phone again. No new messages.\n\nSilence can mean calm — or it can mean the next wave is building.\nEither way, you stay grounded for your child."
        },
        {
          "id": "a3s5",
          "choices": [
            {
              "id": "a3cA",
              "text": "“Before we leave, I want to set a calm tone. I’ll send one clear message.”",
              "goto": "a3s6A",
              "effects": { "tension": -1 }
            },
            {
              "id": "a3cB",
              "text": "“I’ll wait and see. Maybe less contact right now is better.”",
              "goto": "a3s6B",
              "effects": {}
            },
            {
              "id": "a3cC",
              "text": "“I’ll call briefly. Texts leave too much room for misunderstandings.”",
              "goto": "a3s6C",
              "effects": { "trust": 1 }
            },
            {
              "id": "a3cD",
              "text": "Focus fully on getting your child ready.",
              "goto": "a3s6D",
              "effects": { "childStress": -1 }
            }
          ]
        },
        {
          "id": "a3s6A",
          "text": "You send a short, steady message:\n“We're getting ready. Let's keep today calm.”\n\nA reply comes quickly: “Okay.”\nShort, but promising."
        },
        {
          "id": "a3s6B",
          "text": "You put the phone down.\n\nSometimes quiet is a gift — space for everyone to breathe."
        },
        {
          "id": "a3s6C",
          "text": "You call.\n\nThey pick up with a shaky “Hello?”\nThe call is brief and uneven, but hearing tone helps."
        },
        {
          "id": "a3s6D",
          "text": "You focus on tying shoelaces and smoothing hair instead of smoothing conflict.\n\nSometimes the best choice is centering the child."
        },
        {
          "id": "a3end",
          "endOfAct": true,
          "text": "Act 3 ends with a quiet win: you've set the tone.\n\nNext comes Act 4 — the face-to-face moment."
        }
      ]
    },

    {
      "id": "act-4",
      "title": "The Handover Moment",
      "steps": [
        {
          "id": "a4s1",
          "text": "You arrive a few minutes early.\nYour child holds your hand tightly — the kind of grip that says more than words.\n\nYou steady your breathing. Handover days always carry tension, even on the better ones."
        },
        {
          "id": "a4s2",
          "text": "Your ex approaches.\nTheir posture says everything: tired, guarded, trying.\n\nBipolar disorder doesn’t disappear during handovers — it just becomes something both of you silently manage."
        },
        {
          "id": "a4s3",
          "text": "Your child lets go of your hand and steps forward.\n\nThis first moment — the first glance, the first 'hi' — often sets the tone."
        },
        {
          "id": "a4s4",
          "text": "Your ex gives a soft smile.\nIt's small, but real.\n\n“Hey, buddy/sweetheart,” they say.\n\nThe warmth in their voice is genuine, even if the morning wasn't easy."
        },
        {
          "id": "a4s5",
          "choices": [
            {
              "id": "a4cA",
              "text": "“I'm glad you made it. Let's keep things calm today.”",
              "goto": "a4s6A",
              "effects": { "tension": -1 }
            },
            {
              "id": "a4cB",
              "text": "“Before you go, can we quickly sync about the rest of the day?”",
              "goto": "a4s6B",
              "effects": {}
            },
            {
              "id": "a4cC",
              "text": "“If anything becomes too much, just text me. No pressure.”",
              "goto": "a4s6C",
              "effects": { "trust": 1 }
            },
            {
              "id": "a4cD",
              "text": "Say nothing — keep the focus on your child.",
              "goto": "a4s6D",
              "effects": {}
            }
          ]
        },
        {
          "id": "a4s6A",
          "text": "Your ex nods.\n“Yeah… I want that too.”\n\nA small pause — human, not tense."
        },
        {
          "id": "a4s6B",
          "text": "“Sure. What do you need to know?” they ask, shifting their weight.\n\nThey're trying — and that effort matters."
        },
        {
          "id": "a4s6C",
          "text": "They take a breath.\n“Thanks. I don't always know how to say when I'm struggling.”\n\nTheir honesty softens the moment."
        },
        {
          "id": "a4s6D",
          "text": "You keep the focus on your child, who’s already chatting happily.\n\nSometimes silence is the safest choice."
        },
        {
          "id": "a4end",
          "endOfAct": true,
          "text": "Act 4 ends with meaningful stability.\n\nNext comes Act 5 — the quiet after the handover."
        }
      ]
    },

    {
      "id": "act-5",
      "title": "After the Handover",
      "steps": [
        {
          "id": "a5s1",
          "text": "The door closes.\n\nThe silence that follows is always sharper than you expect — like the house exhales at once.\n\nEvery handover leaves a small emotional echo. Today is no different."
        },
        {
          "id": "a5s2",
          "text": "You move through the rooms picking up small traces of the morning — a toy, a cup, a sock.\n\nThe quiet gives you space to feel everything you held back earlier."
        },
        {
          "id": "a5s3",
          "text": "You replay moments: the message, the tension, the meeting, your child's smile.\n\nNone of it is simple.\nBut you did the best you could with today's emotional weather."
        },
        {
          "id": "a5s4",
          "text": "You remind yourself: co-parenting with bipolar disorder isn't about perfection — it's about consistency.\n\nYou showed up.\nYou stayed calm.\nYour child felt safe.\n\nThat matters more than anything else."
        },
        {
          "id": "a5s5",
          "choices": [
            {
              "id": "a5cA",
              "text": "Sit with the feelings for a moment — let yourself decompress.",
              "goto": "a5s6A",
              "effects": {}
            },
            {
              "id": "a5cB",
              "text": "Check your phone to see if your ex wrote anything.",
              "goto": "a5s6B",
              "effects": {}
            },
            {
              "id": "a5cC",
              "text": "Clean the space a little. Physical order helps settle emotional noise.",
              "goto": "a5s6C",
              "effects": { "tension": -1 }
            },
            {
              "id": "a5cD",
              "text": "Call a trusted friend or family member.",
              "goto": "a5s6D",
              "effects": { "trust": 1 }
            }
          ]
        },
        {
          "id": "a5s6A",
          "text": "You sit quietly, letting your body unwind.\nHands unclench. Shoulders drop.\n\nThe day isn’t over, but this moment belongs to you."
        },
        {
          "id": "a5s6B",
          "text": "You check your phone.\nNothing new.\n\nStrange how silence can feel both peaceful and unsettling."
        },
        {
          "id": "a5s6C",
          "text": "You tidy up slowly.\nWith every small action, the morning softens and the house becomes yours again."
        },
        {
          "id": "a5s6D",
          "text": "“Rough morning?” your friend asks gently.\n\nYou don’t have to explain everything.\nJust being heard helps."
        },
        {
          "id": "a5end",
          "endOfAct": true,
          "text": "Act 5 ends with a quiet truth: co-parenting in these circumstances is hard — and still, you're doing it.\n\nYou protected your child's emotional world today. You kept things steady. You stayed grounded through someone else’s turbulence.\n\nAnd tomorrow, you'll try again.\n\n**End of Scenario.**"
        }
      ]
    }
  ]
}

