{
  "scenarios": [
    {
      "id": "co-parenting-with-bipolar-partner",
      "title": "Co-Parenting with Bipolar Partner",
      "acts": [
        {
          "title": "Act 1 — First Exchange",
          "steps": [
            "You arrive to pick up your child, but your ex seems upset.",
            "They start speaking in a confusing or emotional way.",
            "You must choose whether to stay calm, ignore the behavior, or respond emotionally."
          ]
        },
        {
          "title": "Act 2 — Escalation",
          "steps": [
            "The discussion grows tense, and your ex raises their voice.",
            "Your child notices the tension and becomes unsettled.",
            "Options appear: de-escalate with soothing words, suggest a short break, or argue back."
          ]
        },
        {
          "title": "Act 3 — Resolution",
          "steps": [
            "Depending on choices, you either reach a small compromise, leave things unresolved, or make the situation worse.",
            "If you stayed calm, your child feels reassured.",
            "If you escalated, the conflict lingers and your child feels stressed."
          ]
        }
      ]
    },
    {
      "id": "dating-after-breakup-with-child-involved",
      "title": "Dating After Breakup (With Child Involved)",
      "acts": [
        {
          "title": "Act 1 — First Date",
          "steps": [
            "You decide to meet someone new for coffee.",
            "Your child is staying with your ex.",
            "Do you tell your ex about this date or keep it private?"
          ]
        },
        {
          "title": "Act 2 — Introducing the Idea",
          "steps": [
            "A few weeks later, your child overhears you talking on the phone with the new person.",
            "Your child asks: “Who is that?”",
            "Choices: be honest but gentle, change the subject, or dismiss it quickly."
          ]
        },
        {
          "title": "Act 3 — First Reactions",
          "steps": [
            "Your ex finds out that you’ve started dating.",
            "They confront you — either calmly, defensively, or angrily.",
            "You can choose to: reassure them that your child’s needs come first, argue, or refuse to discuss."
          ]
        },
        {
          "title": "Act 4 — Resolution",
          "steps": [
            "Depending on your decisions:",
            "Positive path: Your ex accepts your right to move on, your child feels secure, and boundaries are set.",
            "Neutral path: Tensions remain but are manageable.",
            "Negative path: Conflict worsens, child feels caught in the middle, and co-parenting suffers."
          ]
        }
      ]
    }
  ]
}